/****************************************************************************
* @file     Rn_Assert.c
* @author   zhupeng
* @version  V1.0.0
* @date     2023.03.16
* @brief    锐能微断言模块
******************************************************************************
* @attention
*
*
****************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <Rn_Debug.h>

#ifdef USE_IAR
#include <assert.h>
#endif

/* Private define ------------------------------------------------------------*/
#ifndef NULL
#define NULL          0
#endif

/* Private enum -------------------------------------------------------------*/

/* Private typedef -----------------------------------------------------------*/

/* Private data ---------------------------------------------------------*/

/* Exported data  ----------------------------------------------------------*/

/* Private functions ------------------------------------------------------------*/

/* Exported functions ------------------------------------------------------- */
#ifdef  USE_RN_Assert

/*****************************************************************************
** Function name:  Rn_AssertFailed
** Description:　出错告警处理
** Parameters:  file:文件路径;line:行数
** Returned value:NONE
******************************************************************************/
void Rn_AssertFailed(uint8_t* file, uint32_t line)
{
    #ifdef USE_RN_RTT
    SEGGER_RTT_printf(0, "RenergyAssert:\r\n    file:%s.\r\n    line:%d\r\n", file, line);
    #endif
    #ifdef USE_IAR
    assert(0);
    #endif
}
#endif

/****************************   (C) COPYRIGHT Renergy   ****************************/
/****************************       END OF FILE     ********************************/
