/****************************************************************************
* @file
* @author   Renergy Application Team
* @version  V1.0.1
* @date
* @brief
******************************************************************************
* @attention
*
*
****************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef _BSP_LVDCMPSAR_H_
#define _BSP_LVDCMPSAR_H_

/* Includes ------------------------------------------------------------------*/

/* Exported define ------------------------------------------------------------*/

/* Exported enum ------------------------------------------------------------*/
/*
typedef enum{
    CHECKLVD            = 0x00, //判断Lvd 标志确定上电或掉电
    CHECKCMP1           = 0x01, //判断cmp1 标志确定上电或掉电
    CHECKCMP2           = 0x02,//判断cmp2 标志确定上电或掉电
    CHECKLVD_CMP1       = 0x03,//判断LVD&cmp1 标志确定上电或掉电
    CHECKLVD_CMP2       = 0x04,//判断LVD&cmp2 标志确定上电或掉电
} ePowerUpDownCheck_TypeDef;

#define  POWERCHACK   CHECKLVD_CMP2
*/
/* Exported types ------------------------------------------------------------*/

/* Exported data  ----------------------------------------------------------*/

/* Exported functions ------------------------------------------------------- */

#endif

/****************************   (C) COPYRIGHT Renergy   ****************************/
/****************************       END OF FILE     ********************************/
